#### Terraform Plan for live environment 📖 `success`

**_N.B. This plan doesn't reflect changes to the lambda source._**

<details><summary>Show Plan</summary>

```

random_password.end_of_day_password: Refreshing state... [id=none]
random_password.end_of_day_username: Refreshing state... [id=none]
aws_dynamodb_table.audit: Refreshing state... [id=live-audit]
aws_dynamodb_table.error: Refreshing state... [id=live-error]
aws_sqs_queue.transactions_dlq: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/755836339707/live-transactions-dlq.fifo]
aws_cloudwatch_event_rule.match_fee_schedule: Refreshing state... [id=live-match-fee-transfer-schedule]
aws_cloudwatch_event_rule.refresh_tokens_schedule: Refreshing state... [id=live-refresh-tokens-schedule]
aws_acm_certificate.api: Refreshing state... [id=arn:aws:acm:eu-west-2:755836339707:certificate/5f54120a-dd46-4652-857d-f0a796e8799d]
aws_api_gateway_rest_api.api: Refreshing state... [id=9d7wigd9k0]
aws_dynamodb_table.config: Refreshing state... [id=config]
aws_dynamodb_table.token: Refreshing state... [id=token]
aws_iam_policy.endpoint_logging_policy: Refreshing state... [id=arn:aws:iam::755836339707:policy/live/lambda/common-lambda-logging-20220522195132784700000005]
aws_iam_role.lambda_iam_role: Refreshing state... [id=common-lambda-role-20220522195131837800000004]
aws_iam_role.match_fee_lambda_iam_role: Refreshing state... [id=match-fee-lambda-role-20220522195132826800000006]
aws_iam_role.end_of_day_endpoint_lambda_iam_role: Refreshing state... [id=end-of-day-lambda-role-20220603111510713100000001]
aws_iam_role.end_of_day_lambda_iam_role: Refreshing state... [id=end-of-day-lambda-role-20220522195131837700000002]
aws_iam_role.queue_processor_lambda_iam_role: Refreshing state... [id=queue-processor-lambda-role-20220522195131837600000001]
aws_route53_record.api_certificate_validation["api.accounting.mersthamcc.co.uk"]: Refreshing state... [id=Z047058117NM6D6MGKBNH__a438fda6ab65c1cc4dd2220a53c55bd8.api.accounting.mersthamcc.co.uk._CNAME]
aws_sqs_queue.transactions: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/755836339707/live-transactions.fifo]
module.end_of_day_endpoint.aws_api_gateway_resource.endpoint_resource: Refreshing state... [id=hdotd7]
module.sage_callback_endpoint.aws_api_gateway_resource.endpoint_resource: Refreshing state... [id=k0dzcm]
module.purge_endpoint.aws_api_gateway_resource.endpoint_resource: Refreshing state... [id=pyskzt]
module.sage_endpoint.aws_api_gateway_resource.endpoint_resource: Refreshing state... [id=q8yl1g]
aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=common-lambda-role-20220522195131837800000004-20220522195135532200000009]
aws_iam_role_policy_attachment.end_of_day_endpoint_lambda_logs: Refreshing state... [id=end-of-day-lambda-role-20220603111510713100000001-20220603111511490000000003]
module.purge_endpoint.aws_lambda_function.endpoint_lambda: Refreshing state... [id=live-purge-unpaid-lambda]
aws_iam_policy.lambda_audit_dynamo_policy: Refreshing state... [id=arn:aws:iam::755836339707:policy/live/lambda/audit-lambda-dynamo-policy-2022052219514030170000000c]
aws_iam_policy.lambda_dynamo_policy: Refreshing state... [id=arn:aws:iam::755836339707:policy/live/lambda/common-lambda-dynamo-policy-2022052219514030170000000b]
aws_iam_role_policy_attachment.match_fee_lambda_logs: Refreshing state... [id=match-fee-lambda-role-20220522195132826800000006-2022052219513658280000000a]
aws_lambda_function.match_fee_lambda: Refreshing state... [id=live-match-fee-transfer-schedule]
aws_lambda_function.refresh_token_lambda: Refreshing state... [id=live-refresh-tokens-schedule]
aws_iam_role_policy_attachment.end_of_day_lambda_logs: Refreshing state... [id=end-of-day-lambda-role-20220522195131837700000002-20220522195135221500000007]
aws_lambda_function.process_end_of_day_lambda: Refreshing state... [id=live-end-of-day-processor]
aws_acm_certificate_validation.api: Refreshing state... [id=2022-05-22 19:52:11.669 +0000 UTC]
aws_lambda_function.process_transactions_sqs_lambda: Refreshing state... [id=live-transaction-sqs-lambda]
aws_iam_role_policy_attachment.queue_processor_lambda_logs: Refreshing state... [id=queue-processor-lambda-role-20220522195131837600000001-20220522195135233900000008]
module.end_of_day_endpoint.aws_api_gateway_method.endpoint_method: Refreshing state... [id=agm-9d7wigd9k0-hdotd7-POST]
module.sage_callback_endpoint.aws_api_gateway_method.endpoint_method: Refreshing state... [id=agm-9d7wigd9k0-k0dzcm-GET]
module.purge_endpoint.aws_api_gateway_method.endpoint_method: Refreshing state... [id=agm-9d7wigd9k0-pyskzt-POST]
module.sage_endpoint.aws_api_gateway_method.endpoint_method: Refreshing state... [id=agm-9d7wigd9k0-q8yl1g-GET]
aws_iam_role_policy_attachment.queue_processor_lambda_audit_dynamo: Refreshing state... [id=queue-processor-lambda-role-20220522195131837600000001-20220522195143481500000010]
aws_iam_role_policy_attachment.queue_processor_lambda_dynamo: Refreshing state... [id=queue-processor-lambda-role-20220522195131837600000001-2022052219514244750000000e]
aws_iam_role_policy_attachment.end_of_day_lambda_dynamo: Refreshing state... [id=end-of-day-lambda-role-20220522195131837700000002-20220522195143494700000011]
aws_iam_role_policy_attachment.match_fee_lambda_dynamo: Refreshing state... [id=match-fee-lambda-role-20220522195132826800000006-2022052219514243800000000d]
aws_iam_role_policy_attachment.lambda_dynamo: Refreshing state... [id=common-lambda-role-20220522195131837800000004-2022052219514244880000000f]
aws_iam_role_policy_attachment.end_of_day_endpoint_lambda_dynamo: Refreshing state... [id=end-of-day-lambda-role-20220603111510713100000001-20220603111511473500000002]
time_sleep.wait_60_seconds: Refreshing state... [id=2022-05-22T19:52:57Z]
aws_dynamodb_table_item.config: Refreshing state... [id=config|id||live|]
aws_api_gateway_domain_name.api: Refreshing state... [id=api.accounting.mersthamcc.co.uk]
aws_sqs_queue_policy.process_transactions_queue_policy: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/755836339707/live-transactions.fifo]
module.purge_endpoint.aws_lambda_permission.endpoint_execution_permission: Refreshing state... [id=AllowAPIGatewayInvoke]
module.purge_endpoint.aws_api_gateway_integration.endpoint_integration: Refreshing state... [id=agi-9d7wigd9k0-pyskzt-POST]
module.purge_endpoint.aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/live-purge-unpaid-lambda]
aws_lambda_permission.allow_cloudwatch_to_call_match_fee_lambda: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_log_group.match_fee_lambda_log_group: Refreshing state... [id=/aws/lambda/live-match-fee-transfer-schedule]
aws_cloudwatch_event_target.match_fee_schedule_target: Refreshing state... [id=live-match-fee-transfer-schedule-8]
aws_cloudwatch_event_target.refresh_tokens_schedule_target: Refreshing state... [id=live-refresh-tokens-schedule-8]
aws_cloudwatch_log_group.refresh_token_lambda_log_group: Refreshing state... [id=/aws/lambda/live-refresh-tokens-schedule]
aws_lambda_permission.allow_cloudwatch_to_call_refresh_tokens_lambda: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_log_group.process_end_of_day_lambda_log_group: Refreshing state... [id=/aws/lambda/live-end-of-day-processor]
module.end_of_day_endpoint.aws_lambda_function.endpoint_lambda: Refreshing state... [id=live-end-of-day-lambda]
aws_route53_record.api: Refreshing state... [id=Z047058117NM6D6MGKBNH_api.accounting.mersthamcc.co.uk_A]
aws_cloudwatch_log_group.sqs_transactions_log_group: Refreshing state... [id=/aws/lambda/live-transaction-sqs-lambda]
aws_lambda_event_source_mapping.lambda_sqs_mapping: Refreshing state... [id=990e1d50-f91c-4bff-bbec-a614e13dc219]
aws_iam_policy.invoke_processor_policy: Refreshing state... [id=arn:aws:iam::755836339707:policy/live/lambda/invoke-processor-20220603111518310000000004]
module.sage_callback_endpoint.aws_lambda_function.endpoint_lambda: Refreshing state... [id=live-sage-callback-lambda]
module.sage_endpoint.aws_lambda_function.endpoint_lambda: Refreshing state... [id=live-sage-lambda]
aws_iam_role_policy_attachment.end_of_day_endpoint_lambda_invoke: Refreshing state... [id=end-of-day-lambda-role-20220603111510713100000001-20220603111518569300000005]
aws_cloudwatch_log_metric_filter.transaction_processing_missing_tender_metric: Refreshing state... [id=live-transaction-processing-missing-tender-warning]
aws_cloudwatch_log_metric_filter.transaction_processing_error_metric: Refreshing state... [id=live-transaction-processing-errors]
aws_cloudwatch_log_metric_filter.transaction_processing_success_metric: Refreshing state... [id=live-transaction-processing-success]
aws_cloudwatch_log_metric_filter.transaction_processing_skip_metric: Refreshing state... [id=live-transaction-processing-skips]
module.end_of_day_endpoint.aws_lambda_permission.endpoint_execution_permission: Refreshing state... [id=AllowAPIGatewayInvoke]
module.end_of_day_endpoint.aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/live-end-of-day-lambda]
module.end_of_day_endpoint.aws_api_gateway_integration.endpoint_integration: Refreshing state... [id=agi-9d7wigd9k0-hdotd7-POST]
module.sage_callback_endpoint.aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/live-sage-callback-lambda]
module.sage_callback_endpoint.aws_api_gateway_integration.endpoint_integration: Refreshing state... [id=agi-9d7wigd9k0-k0dzcm-GET]
module.sage_callback_endpoint.aws_lambda_permission.endpoint_execution_permission: Refreshing state... [id=AllowAPIGatewayInvoke]
module.sage_endpoint.aws_api_gateway_integration.endpoint_integration: Refreshing state... [id=agi-9d7wigd9k0-q8yl1g-GET]
module.sage_endpoint.aws_lambda_permission.endpoint_execution_permission: Refreshing state... [id=AllowAPIGatewayInvoke]
module.sage_endpoint.aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/live-sage-lambda]
aws_api_gateway_deployment.deployment: Refreshing state... [id=4wbnj8]
aws_api_gateway_stage.api_stage: Refreshing state... [id=ags-9d7wigd9k0-live]
aws_api_gateway_base_path_mapping.api: Refreshing state... [id=api.accounting.mersthamcc.co.uk/]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_sqs_queue.transactions has changed
  ~ resource "aws_sqs_queue" "transactions" {
        id                                = "https://sqs.eu-west-2.amazonaws.com/755836339707/live-transactions.fifo"
        name                              = "live-transactions.fifo"
      ~ policy                            = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = [
                              - "arn:aws:iam::755836339707:role/live/lambda/match-fee-lambda-role-20220522195132826800000006",
                                "arn:aws:iam::755836339707:role/live/lambda/end-of-day-lambda-role-20220522195131837700000002",
                              + "arn:aws:iam::755836339707:role/live/lambda/match-fee-lambda-role-20220522195132826800000006",
                            ]
                        }
                        # (4 unchanged elements hidden)
                    },
                    {
                        Action    = [
                            "sqs:ReceiveMessage",
                            "sqs:GetQueueAttributes",
                            "sqs:DeleteMessage",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::755836339707:role/live/lambda/queue-processor-lambda-role-20220522195131837600000001"
                        }
                        Resource  = "arn:aws:sqs:eu-west-2:755836339707:live-transactions.fifo"
                        Sid       = "ReceiveSQS"
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags                              = {}
        # (15 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_api_key.match_fee_api_key will be created
  + resource "aws_api_gateway_api_key" "match_fee_api_key" {
      + arn               = (known after apply)
      + created_date      = (known after apply)
      + description       = "Managed by Terraform"
      + enabled           = true
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + name              = "match-fee-api-key"
      + tags_all          = {
          + "Application" = "accounts-api"
          + "Environment" = "live"
        }
      + value             = (sensitive value)
    }

  # aws_api_gateway_deployment.deployment must be replaced
+/- resource "aws_api_gateway_deployment" "deployment" {
      ~ created_date  = "2022-05-22T20:05:57Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:eu-west-2:755836339707:9d7wigd9k0/" -> (known after apply)
      ~ id            = "4wbnj8" -> (known after apply)
      ~ invoke_url    = "https://9d7wigd9k0.execute-api.eu-west-2.amazonaws.com/" -> (known after apply)
      ~ triggers      = {
          - "redeployment" = "cfd4b062bee5e9214c33ac534f91ba19c7136a66"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.api_stage will be updated in-place
  ~ resource "aws_api_gateway_stage" "api_stage" {
      ~ deployment_id         = "4wbnj8" -> (known after apply)
        id                    = "ags-9d7wigd9k0-live"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # aws_api_gateway_usage_plan.usage_plan will be created
  + resource "aws_api_gateway_usage_plan" "usage_plan" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "match-fee-usage-plan"
      + tags_all = {
          + "Application" = "accounts-api"
          + "Environment" = "live"
        }

      + api_stages {
          + api_id = "9d7wigd9k0"
          + stage  = "live"
        }
    }

  # aws_api_gateway_usage_plan_key.match_fee_api_key will be created
  + resource "aws_api_gateway_usage_plan_key" "match_fee_api_key" {
      + id            = (known after apply)
      + key_id        = (known after apply)
      + key_type      = "API_KEY"
      + name          = (known after apply)
      + usage_plan_id = (known after apply)
      + value         = (known after apply)
    }

  # module.match_fee_transfer_endpoint.aws_api_gateway_integration.endpoint_integration will be created
  + resource "aws_api_gateway_integration" "endpoint_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "9d7wigd9k0"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.match_fee_transfer_endpoint.aws_api_gateway_method.endpoint_method will be created
  + resource "aws_api_gateway_method" "endpoint_method" {
      + api_key_required = true
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "9d7wigd9k0"
    }

  # module.match_fee_transfer_endpoint.aws_api_gateway_resource.endpoint_resource will be created
  + resource "aws_api_gateway_resource" "endpoint_resource" {
      + id          = (known after apply)
      + parent_id   = "nn9a2xa8jl"
      + path        = (known after apply)
      + path_part   = "match-fee-transfer"
      + rest_api_id = "9d7wigd9k0"
    }

  # module.match_fee_transfer_endpoint.aws_cloudwatch_log_group.lambda_log_group will be created
  + resource "aws_cloudwatch_log_group" "lambda_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/live-match-fee-transfer-lambda"
      + retention_in_days = 90
      + tags_all          = {
          + "Application" = "accounts-api"
          + "Environment" = "live"
        }
    }

  # module.match_fee_transfer_endpoint.aws_lambda_function.endpoint_lambda will be created
  + resource "aws_lambda_function" "endpoint_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "live-match-fee-transfer-lambda"
      + handler                        = "cricket.merstham.website.accounts.lambda.MatchFeeTransfer::handleRequest"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 3072
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::755836339707:role/live/lambda/match-fee-lambda-role-20220522195132826800000006"
      + runtime                        = "java11"
      + s3_bucket                      = "mersthamcc-accounts-deployment-versioned"
      + s3_key                         = "accounts.zip"
      + s3_object_version              = "WOMmBE8uhvnUk9DVUORM9waS9CS4OqA5"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Application" = "accounts-api"
          + "Environment" = "live"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CONFIG_NAME"       = "live"
              + "JAVA_TOOL_OPTIONS" = "-XX:+TieredCompilation -XX:TieredStopAtLevel=1"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.match_fee_transfer_endpoint.aws_lambda_permission.endpoint_execution_permission will be created
  + resource "aws_lambda_permission" "endpoint_execution_permission" {
      + action        = "lambda:InvokeFunction"
      + function_name = "live-match-fee-transfer-lambda"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = "arn:aws:execute-api:eu-west-2:755836339707:9d7wigd9k0/*/*"
      + statement_id  = "AllowAPIGatewayInvoke"
    }

Plan: 10 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>